spec/cassettes/create_a_payment_on_succesful_charge/creates_payment_using_webhook_from_stripe_for_successful_charge.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_16Iu9OCgpBrdIpYj9NQqAegb
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_ac7hK0eIfCOZM0kOmQPJmvyr
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.16.0-41-generic (buildd@toyol) (gcc version 4.9.1 (Ubuntu 4.9.1-16ubuntu6)
        ) #57-Ubuntu SMP Thu Jun 18 08:44:16 UTC 2015","hostname":"falon-the-tower"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Jun 2015 16:33:31 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1989'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6W7RKk7IM07Cyp
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_16Iu9OCgpBrdIpYj9NQqAegb",
          "created": 1435553146,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_16Iu9OCgpBrdIpYjArgIbvSD",
              "object": "charge",
              "created": 1435553146,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_16Iu9NCgpBrdIpYj725ywf4i",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 6,
                "exp_year": 2015,
                "fingerprint": "WK9Xk0j3v4YY5hjj",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6Vw1bCqE3Uqptz"
              },
              "captured": true,
              "balance_transaction": "txn_16Iu9OCgpBrdIpYjETlbDUnc",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_6Vw1bCqE3Uqptz",
              "invoice": "in_16Iu9OCgpBrdIpYjQqhnOe0w",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "Video nirvana",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "destination": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_16Iu9OCgpBrdIpYjArgIbvSD/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_6Vw1Li08FlPYGF",
          "api_version": "2015-04-07"
        }
    http_version: 
  recorded_at: Mon, 29 Jun 2015 16:33:33 GMT
recorded_with: VCR 2.9.3
